# Challenge Set 9
## Part III: Soccer Data

*Introductory - Intermediate level SQL*

In [3]:
import sqlite3
import pandas as pd

In [17]:
cnx = sqlite3.connect('/Users/luken2/Documents/GitHub/nfl-draft/SQLChallenges/database.sqlite')
cursor=cnx.cursor()

#### 1. Which team scored the most points when playing at home?

In [21]:
qry = """
SELECT home_team_api_id, sum(home_team_goal) FROM Match
GROUP BY home_team_api_id ORDER BY sum(home_team_goal) DESC;"""

pd.read_sql_query(qry, cnx)

     home_team_api_id  sum(home_team_goal)
0                8633                  505
1                8634                  495
2                9925                  389
3                9823                  382
4                8640                  370
..                ...                  ...
294              7992                   14
295            108893                   14
296              4064                   13
297              7869                   12
298              8357                   10

[299 rows x 2 columns]

#### 2. Did this team also score the most points when playing away?

In [22]:
qry = """
SELECT away_team_api_id, sum(away_team_goal) FROM Match
GROUP BY away_team_api_id ORDER BY sum(away_team_goal) DESC;"""

pd.read_sql_query(qry, cnx)

     away_team_api_id  sum(away_team_goal)
0                8634                  354
1                8633                  338
2                9925                  306
3                8593                  287
4                8640                  282
..                ...                  ...
294             10278                    9
295              6367                    8
296              8690                    7
297            108893                    7
298              8550                    5

[299 rows x 2 columns]

#### 3. How many matches resulted in a tie?

In [29]:
qry = """
SELECT COUNT(match_api_id) FROM Match
WHERE home_team_goal=away_team_goal;"""

pd.read_sql_query(qry, cnx)

   COUNT(match_api_id)
0                 6596

#### 4. How many players have Smith for their last name? How many have 'smith' anywhere in their name?

In [35]:
qry = """
SELECT COUNT(player_api_id) FROM Player
WHERE player_name LIKE '% smith%';"""

pd.read_sql_query(qry, cnx)

   COUNT(player_api_id)
0                    15

In [36]:
qry = """
SELECT COUNT(player_api_id) FROM Player
WHERE player_name LIKE '%smith%';"""

pd.read_sql_query(qry, cnx)

   COUNT(player_api_id)
0                    18

#### 5. What was the median tie score? Use the value determined in the previous question for the number of tie games. *Hint:* PostgreSQL does not have a median function. Instead, think about the steps required to calculate a median and use the [`WITH`](https://www.postgresql.org/docs/8.4/static/queries-with.html) command to store stepwise results as a table and then operate on these results.

In [40]:
qry = """
SELECT COUNT(match_api_id), home_team_goal, away_team_goal FROM Match
WHERE home_team_goal=away_team_goal 
GROUP BY home_team_goal

;"""

pd.read_sql_query(qry, cnx)

   COUNT(match_api_id)  home_team_goal  away_team_goal
0                 1978               0               0
1                 3014               1               1
2                 1310               2               2
3                  264               3               3
4                   27               4               4
5                    2               5               5
6                    1               6               6

Median tie score was 1 because 6596/2 = 3298 and the 3298th value is in 1

#### 6. What percentage of players prefer their left or right foot? *Hint:* Calculate either the right or left foot, whichever is easier based on how you setup the problem.

In [42]:
qry = """
SELECT COUNT(player_api_id), preferred_foot FROM Player_Attributes
GROUP BY preferred_foot
;"""

pd.read_sql_query(qry, cnx)

   COUNT(player_api_id) preferred_foot
0                   836           None
1                 44733           left
2                138409          right

Left foot: 44733/183978 = 24%

Right foot: 75%